# 1.	Найти НОК двух чисел
# first = int(input("Введите первое число: "))
# second = int(input("Введите второе число: "))
#
# for i in range(1, 10000):
#     if (i % first == 0 and i % second == 0):
#         print(f'Наименьшее общее кратное чисел {first} и {second} равно {i}')
#         break

# 2.	Вычислить число Пи c заданной точностью d
# Пример: при d = 0.001,  c= 3.141.




# 3.	Составить список простых множителей натурального числа N
# N = int(input("Введите число: "))
# array = []
# i = 1
# while N > 1:
#     if N % i == 0:
#         N = N // i
#         array.append(i)
#     i += 1
# print(array)



# 4.	Дана последовательность чисел. Получить список неповторяющихся элементов исходной последовательности
# Пример: [1, 2, 3, 5, 1, 5, 3, 10] => [1, 2, 3, 5, 10]

# import random
# array = []
# for i in range(0, 10):
#     array.append(random.randint(0, 10))
# print(array)
# array = set(array)
# print(array)



# + на тему файловой системы:
# 5.  Дан текстовый файл, содержащий целые числа. Удалить из него все четные числа.
